Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.NoOperationProgress`1
No operation for IProgress.
Used when progress reporting is not needed from the user.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.NoOperationProgress`1.Report(`0)
Does nothing